cf/Catalogs/СпецификацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>СпецификацииНоменклатуры</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСпецификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСпецификаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВерсии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаИмпортер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиМТР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственнаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСпецификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСпецификаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дистрибьютор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПозиции</Name>
					<Comment>Эталон/Дубль/Одиночная позиция</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.нсиТипыПозицийСправочников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭталоннаяПозиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпецификацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакИспользования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.нсиПризнакиИспользованияПозиций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСпецификацииВУчетнойСистеме</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходныеКомплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.нсиМТР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.итСтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКомплектации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипКомплектации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГосНормативПотерь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыходныеИзделия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.нсиМТР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Enums/ВидыСпецификаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВидыСпецификаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сборочная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Узел</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/СпецификацииНоменклатуры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ВидСпецификации = ПредопределенноеЗначение("Перечисление.ВидыСпецификаций.Сборочная") Тогда
		ЗаполнитьВыходноеИзделиеВШапке();
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.КодВерсии = "00001";
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыходноеИзделиеВШапке()
	
	Если Объект.ВыходныеИзделия.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТаблицы = Объект.ВыходныеИзделия.Получить(0);
	Объект.Номенклатура			= СтрокаТаблицы.Номенклатура;
	Количество 					= СтрокаТаблицы.Количество;
	ЕдиницаИзмерения 			= СтрокаТаблицы.ЕдиницаИзмерения;
	
КонецПроцедуры // ЗаполнитьВыходноеИзделиеВШапке()


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЗаполнитьСтрокуВыходныхИзделий();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтрокуВыходныхИзделий()
	
	Если Объект.ВидСпецификации <> ПредопределенноеЗначение("Перечисление.ВидыСпецификаций.Сборочная") Тогда
		Возврат;
	КонецЕсли;
		
	Объект.ВыходныеИзделия.Очистить();
	
	НоваяСтрока = Объект.ВыходныеИзделия.Добавить();
	НоваяСтрока.Номенклатура = Объект.Номенклатура;
	НоваяСтрока.Количество = Количество;
	НоваяСтрока.ЕдиницаИзмерения = ЕдиницаИзмерения;
	
КонецПроцедуры // ПеренестиНоменклатуруВВыходныеИзделия()

&НаКлиенте
Процедура ИсходныеКомплектующиеНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ИсходныеКомплектующие.ТекущиеДанные;
	
	ТекущиеДанные.ЕдиницаИзмерения = НайтиЕдиницуИзмеренияПоБазовойНаСервере(ТекущиеДанные.Номенклатура);;
	ТекущиеДанные.СтатьяЗатрат = GlobalMDM.ПолучитьРеквизитНаСервере(ТекущиеДанные.Номенклатура, "СтатьяЗатрат");
	ТекущиеДанные.ГосНормативПотерь = НайтиГосНормативПотерьНаСервере(ТекущиеДанные.Номенклатура, Объект.ПроизводственнаяПлощадка);
	
КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  Номенклатура  - СправочникСсылка.нсиМТР - Номенклатура
//  ПроизводственнаяПлощадка  - СправочникСсылка.Организации - Производственная площадка
//
// Возвращаемое значение:
//   Число   - значение гос. норматив потерь
//   0       - когда значение не найдено
&НаСервереБезКонтекста
Функция НайтиГосНормативПотерьНаСервере(Номенклатура, ПроизводственнаяПлощадка)

	Результат = 0;
	Если ЗначениеЗаполнено(Номенклатура) 
		И ЗначениеЗаполнено(ПроизводственнаяПлощадка) Тогда
		Отбор = Новый Структура();
		Отбор.Вставить("Производитель", ПроизводственнаяПлощадка);
		МассивСтрок = Номенклатура.РеквизитыПроизводителей.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() Тогда
			Результат = МассивСтрок[0].ГосНормативПотерь;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // НайтиГосНормативПотерьНаСервере(ТекущиеДанные.Номенклатура, Объект.ПроизводственнаяПлощадка)()
 
&НаСервереБезКонтекста
Функция НайтиЕдиницуИзмеренияПоБазовойНаСервере(НоменклатураСсылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕдиницыИзмерения.Ссылка
		|ИЗ
		|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|ГДЕ
		|	ЕдиницыИзмерения.Владелец = &Владелец
		|	И ЕдиницыИзмерения.ЕдиницаПоКлассификатору = &ЕдиницаПоКлассификатору";
	
	Запрос.УстановитьПараметр("Владелец", НоменклатураСсылка);
	Запрос.УстановитьПараметр("ЕдиницаПоКлассификатору", НоменклатураСсылка.БазоваяЕдиницаИзмерения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЕдиницаИзмерения = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат ЕдиницаИзмерения;

КонецФункции // НайтиЕдиницуИзмеренияПоБазовойНаСервере()


&НаКлиенте
Процедура УчастникиОбменаПриИзменении(Элемент)
	//КутьяАА ITRR
	Если Элемент.ТекущийЭлемент.Имя = "УчастникиОбменаОбмен" Тогда
		Модифицированность = Истина;
	КонецЕсли; 
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//КутьяАА ITRR
	MDMСервер.ЗаполнитьУчастниковОбмена(ЭтаФорма);
	MDMСервер.УстановитьУсловноеОформление(ЭтаФорма);
	MDMСервер.ДоступностьУчастниковОбмена(ЭтаФорма);
	
	Если Параметры.Ключ.Пустая() Тогда
		Номенклатура = Справочники.нсиМТР.ПустаяСсылка();
		Если Параметры.ПараметрыВыбора.Свойство("Номенклатура", Номенклатура) Тогда
			Объект.Номенклатура = Номенклатура;
			НоменклатураПриИзмененииНаСервере();
			ЕдиницаИзмерения = НайтиЕдиницуИзмеренияПоБазовойНаСервере(Номенклатура);
		КонецЕсли; 
		Объект.ПолнаяСинхронизацияMDM = Истина;
	КонецЕсли; 
	
	GUID_MDM = Объект.Ссылка.УникальныйИдентификатор();
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//КутьяАА ITRR
	Если НЕ Отказ И Модифицированность Тогда
		MDMСервер.ЗаписатьУчастниковОбмена(ЭтаФорма);
	КонецЕсли; 
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	//КутьяАА ITRR <<
	MDMСервер.ДоступностьУчастниковОбмена(ЭтаФорма);
	
	УИ = Объект.Ссылка.УникальныйИдентификатор();
	Если НЕ GUID_MDM = УИ Тогда
		GUID_MDM = УИ;
	КонецЕсли; 
	//>>
КонецПроцедуры

//КутьяАА ITRR
&НаСервере
Процедура НоменклатураПриИзмененииНаСервере()
	Если НЕ ЗначениеЗаполнено(Объект.Дистрибьютор)
		И ЗначениеЗаполнено(Объект.Номенклатура.Дистрибьютор) Тогда
		Объект.Дистрибьютор = Объект.Номенклатура.Дистрибьютор;
	КонецЕсли; 
	
	MDMСервер.ЗаполнитьУчастниковОбмена(ЭтаФорма);
КонецПроцедуры

//КутьяАА ITRR
&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	НоменклатураПриИзмененииНаСервере();
	ЕдиницаИзмерения = НайтиЕдиницуИзмеренияПоБазовойНаСервере(Объект.Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура ИсходныеКомплектующиеНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ПроверитьВыбранноеЗначениеНаСервереОтказ(ВыбранноеЗначение,Объект.ПроизводственнаяПлощадка) Тогда
		Сообщить("Выбранная номенклатура не может быть использована для данной производственной площадки.", СтатусСообщения.Важное);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервереБезКонтекста
Функция ПроверитьВыбранноеЗначениеНаСервереОтказ(ВыбранноеЗначение,ПроизводственнаяПлощадка)

	Возврат ВыбранноеЗначение.LocalMaterialType.СухиеКомпоненты 
		И ВыбранноеЗначение.РеквизитыПроизводителей.Найти(ПроизводственнаяПлощадка) = Неопределено;

КонецФункции // ПроверитьВыбранноеЗначениеНаСервере()
